# StructuralConnectionSetOfRefsChanged Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralConnectionFailures..::..StructuralConnectionSetOfRefsChanged Property
BuiltInFailures..::..StructuralConnectionFailures Class See Also
---
The set of input elements was changed and the connection has been adjusted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StructuralConnectionSetOfRefsChanged { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralConnectionSetOfRefsChanged As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StructuralConnectionSetOfRefsChanged {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace